app/controllers/priorities_controller.rb

  def index
    @priorities = Priority.all
---
SELECT * FROM "priorities"

  def show
    @priority = Priority.find(params[:id])
---
SELECT * FROM "priorities" WHERE ("priorities"."id" = 1)

  def create
    @priority = Priority.new(params[:priority])
    if @priority.save
---
INSERT INTO "priorities" ("name", "created_at", "updated_at", "description") VALUES('Low', '2009-12-17 22:31:40', '2009-12-17 22:31:40', 'Low priority - doesnt matter so much')

  def edit
    @priority = Priority.find(params[:id])
---
SELECT * FROM "priorities" WHERE ("priorities"."id" = 3)

  def update
    @priority = Priority.find(params[:id])
    if @priority.update_attributes(params[:priority])
---
SELECT * FROM "priorities" WHERE ("priorities"."id" = 3)
UPDATE "priorities" SET "updated_at" = '2009-12-17 22:32:45', "name" = 'High' WHERE "id" = 3